# ValidationStatus Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationPart..::..ValidationStatus Property
FabricationPart Class See Also
---
The validation status of the fabrication part.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public ValidationStatus ValidationStatus { get; }
```

Visual Basic
---
```text
Public ReadOnly Property ValidationStatus As ValidationStatus
	Get
```

Visual C++
---
```text
public:
property ValidationStatus ValidationStatus {
	ValidationStatus get ();
}
```

# See Also
FabricationPart Class
Autodesk.Revit.DB Namespace